Repository: robot-xliff-farmer/mapsapi-examples
Catalog: mapsapi-examples.tmx
Source language: ru
Languages: en

source: Пользовательские модули не дописываются в неймспейс ymaps. Поэтому доступ к ним мы можем получить асинхронно через метод ymaps.modules.require.
en: Custom modules are not appended to the ymaps namespace. So we can access them asynchronously through the ymaps.modules.require method.

source: @param Геометрия ломаной.
en: @param Geometry of the polyline.

source: @param {Object} properties Данные ломаной.
en: @param {Object} properties Polyline data.

source: @param {Object} options Опции ломаной. Поддерживается тот же набор опций, что и в классе ymaps.Polyline.
en: @param {Object} options Polyline options. Supports the same set of options as the ymaps.Polyline class.

source: @param {Number} [options.arrowAngle=20] Угол в градусах между основной линией и линиями стрелки.
en: @param {Number} [options.arrowAngle=20] Angle in degrees between the main line and the lines of the arrow.

source: @param {Number} [options.arrowMinLength=3] Минимальная длина стрелки. Если длина стрелки меньше минимального значения, стрелка не рисуется.
en: @param {Number} [options.arrowMinLength=3] Minimum length of the arrow. If the length of the arrow is less than the minimum value, the arrow is not drawn.

source: @param {Number} [options.arrowMaxLength=20] Максимальная длина стрелки.
en: @param {Number} [options.arrowMaxLength=20] Maximum length of the arrow.

source: @param Пиксельная геометрия линии.
en: @param The line's pixel geometry.

source: @param {Object} data Данные оверлея.
en: @param {Object} data The overlay data.

source: @param {Object} options Опции оверлея.
en: @param {Object} options Overlay options.

source: Поля .events и .options обязательные для IOverlay.
en: The .events and .options fields are mandatory for IOverlay.

source: Реализовываем все методы и события, которые требует интерфейс IOverlay.
en: Implementing all the methods and events that the IOverlay interface requires.

source: Военная хитрость - чтобы в прозрачной ломаной хорошо отрисовывались самопересечения, мы рисуем вместо линии многоугольник. Каждый контур многоугольника будет отвечать за часть линии.
en: As a trick to get self-intersections drawn correctly in a transparent polyline, we draw a polygon instead of a polyline. Each contour of the polygon will be responsible for a section of the line.

source: Эта строчка свяжет два менеджера опций. Опции, заданные в родительском менеджере, будут распространяться и на дочерний.
en: This string will connect the two options managers. Options specified in the parent manager will be propagated to the child.

source: Мы слушаем события от дочернего служебного оверлея и прокидываем их на внешнем классе. Это делается для того, чтобы в событии было корректно определено поле target.
en: We listen to events from the child service overlay and throw them on an external class. This is to ensure that the "target" field was correctly defined in the event.

source: Свяжем исходное событие с текущим, чтобы все поля данных дочернего события были доступны в производном событии.
en: Linking the original event with the current one, so that all of the data fields of child events are accessible in a derived event.

source: Будем рисовать стрелку только если длина линии не меньше длины стрелки.
en: We will draw the arrow only if the line length is not less than the length of the arrow.

source: Создадим еще 2 контура для стрелочек.
en: Creating 2 more contours for arrows.

source: Для удобства расчетов повернем стрелку так, чтобы она была направлена вдоль оси y, а потом развернем результаты обратно.
en: For convenience of calculation, we will rotate the arrow so that it is pointing along the y axis, and then turn the results back.

source: Примеры. Стрелка на карте
en: Examples. The arrow on the map

source: Примеры. Изменение цвета кластеров и меток при наведении
en: Examples. Changing the color of clusters and placemarks when hovering

source: Кластеризатор расширяет коллекцию, что позволяет использовать один обработчик для обработки событий всех геообъектов. Будем менять цвет иконок и кластеров при наведении.
en: The clusterer extends the collection, which allows you to use the same handler for processing events of all geo objects. We'll change the color of the icons and clusters on mouse hover.

source: Можно слушать сразу несколько событий, указывая их имена в массиве.
en: You can listen to multiple events at once by specifying their names in the array.

source: Событие произошло на кластере.
en: An event occurred on the cluster.

source: Событие произошло на геообъекте.
en: An event took place on the geo object.

source: 'mediumMapDefaultSet' (по умолчанию);
en: 'mediumMapDefaultSet' (default);

source: Также доступны наборы 'default' и 'largeMapDefaultSet' Элементы управления в наборах подобраны оптимальным образом для карт маленького, среднего и крупного размеров.
en: The 'default' and 'largeMapDefaultSet' sets are also available. Controls in these sets are optimally selected for small, medium and large sized maps.

source: Примеры. Стандартные наборы элементов управления
en: Examples. Standard sets of controls

source: Создаем кластеризатор c красной иконкой (по умолчанию используются синяя).
en: Creating a clusterer with a red icon (the default is blue).

source: Создаем коллекцию геообъектов.
en: Creating a collection of geo objects.

source: Дополнительное поле ввода при включенном режиме кластеризации.
en: Additional input field when clusterization is enabled.

source: Добавляем кластеризатор на карту.
en: Adding the clusterer to the map.

source: Добавление меток с произвольными координатами.
en: Adding placemarks with arbitrary coordinates.

source: Количество меток, которое нужно добавить на карту.
en: The number of placemarks that you want to add to the map.

source: Флаг, показывающий, нужно ли кластеризовать объекты.
en: Flag indicating whether to cluster objects.

source: Размер ячейки кластеризатора, заданный пользователем.
en: The clusterer cell siz, specified by the user.

source: Генерируем нужное количество новых объектов.
en: Generating the required number of new objects.

source: Если используется кластеризатор, то добавляем кластер на карту, если не используется - добавляем на карту коллекцию геообъектов.
en: If you are using the clusterer, add the cluster to the map; if not using it, add the collection of geo objects to the map.

source: Добавлеяем массив меток в кластеризатор.
en: Adding an array of placemarks to the clusterer.

source: Функция, создающая необходимое количество геообъектов внутри указанной области.
en: A function that creates the necessary number of geo objects within a specified area.

source: Создаем нужное количество меток
en: Creating the desired number of placemarks

source: Генерируем координаты метки случайным образом.
en: Generating placemark coordinates randomly.

source: Создаем метку со случайными координатами.
en: Creating a placemark with random coordinates.

source: Функция, генерирующая случайные координаты в пределах области просмотра карты.
en: A function that generates random coordinates within the map viewport.

source: Показывать/скрывать дополнительное поле ввода.
en: Show/hide additional input field.

source: Если пользователь включил режим кластеризации, то появляется дополнительное поле для ввода опции кластеризатора - размер ячейки кластеризации в пикселях. По умолчанию размер ячейки сетки равен 64. При отключении режима кластеризации дополнительное поле ввода скрывается.
en: If the user has enabled clustering, an additional field for entering clusterization options appears - the clusterization cell size in pixels. By default, the cell size is 64. If clustering is disabled, the additional input field is hidden.

source: Удаление всех меток с карты
en: Removing all placemarks from the map

source: Удаляем все метки из кластеризатора.
en: Removing all placemarks from the clusterer.

source: Удаляем все метки из коллекции.
en: Removing all placemarks from the collection.

source: Примеры. Использование кластеризатора
en: Examples. Using clusterization

source: Добавить на карту
en: Add to the map

source: Удалить все метки
en: Remove all placemarks

source: Количество меток: Использовать кластеризатор
en: The number of placemarks: Use the clusterer

source: Функция кластеризует объекты и возвращает ссылку на кластер.
en: The function clusters the objects and returns a reference to the cluster.

source: Массив меток, для которых необходимо отобразить содержимое балуна.
en: An array of placemarks for which you want to display the contents of a balloon.

source: Формируем массив идентификаторов, который будет передан серверу.
en: Forming an array of IDs that will be passed to the server.

source: Запрос к серверу. Сервер обработает массив идентификаторов и на его основе вернет JSON-объект, содержащий текст балуна для заданных меток.
en: Request to the server. The server will process the array of IDs and return a JSON object based on it containing the balloon text for the specified placemarks.

source: Содержимое балуна берем из данных, полученных от сервера. Сервер возвращает массив объектов вида: [ , ...]
en: The contents of the balloon is taken from data received from the server. The server returns an array of objects: [ , ...]

source: Примеры. Динамическая загрузка содержимого балуна кластера
en: Examples. Dynamically loading content of a cluster balloon

source: Примеры. Множественная обводка
en: Examples. Multistroke outline

source: Цвет линии - два значения
en: Line color - two values

source: Ширина линии - два значения
en: Line width - two values

source: Цвет линии - черная, белая и красная
en: Line color - black, white and red

source: Для третьей обводки задаем стиль
en: Setting the style for the third outline

source: Класс [#$dp7] позволяет создавать кнопки и добавлять их на карту через [#$dp8].
en: The [#$dp7] class allows you to create buttons and add them to the map via [#$dp8].

source: Кнопка может принимать 3 вида в зависимости от размера карты и количества других элементов управления на карте. На карте маленького размера в кнопке показываться только иконка, на средней карте показывается только текст, на карте большого размера показывается иконка с текстом. Вы можете зафиксировать кнопку в любом размере или задать только иконку или только текст.
en: A button may have 3 different appearances, depending on the map size and the number of other controls on the map. On a small map, the button displays only the icon; on a medium-size map, the text of the button is shown; on a large map, the button icon is displayed with the text. You can lock the button in any size or you can specify only the icon or text only.

source: У кнопки по умолчанию выставлена максимальная ширина в 90 пикселей. Если ваша кнопка содержит длинный текст, следует задать ей нужный максимальный размер через опцию maxWidth.
en: By default, maximum button width is 90 pixels. If your button contains a long text, you should set it to the desired maximum size using the maxWidth option.

source: Зададим текст и иконку для кнопки.
en: Setting the text and icon for a button.

source: Иконка имеет размер 16х16 пикселей.
en: The icon is 16x16 pixels.

source: Поскольку кнопка будет менять вид в зависимости от размера карты, зададим ей три разных значения maxWidth в массиве.
en: Because the button changes depending on the size of the map, we will give it three different maxWidth values in the array.

source: Будем искусственно переключать размеры кнопки каждую секунду, чтобы показать все варианты внешнего вида кнопки. При изменении размера карты эти перестроения будут происходить автоматически.
en: We will artificially switch the size of the button every second, in order to show all the options for the button appearance. When resizing the map, these changes will occur automatically.

source: Примеры. Добавление кнопки на карту
en: Examples. Adding buttons to the map

source: Зададим ограниченную область прямоугольником, примерно описывающим Кольский полуостров.
en: Setting an area restricted to a rectangle that approximately defines the Kola Peninsula.

source: Примеры. Использование опции ограничения области просмотра карты.
en: Examples. Using restrictions of the map viewport.

source: С помощью метода [#$dp8] можно создавать объекты на карте из их JSON-описания.
en: Using the [#$dp8] method, you can create objects on the map from their JSON descriptions.

source: В данном примере рассматривается, как добавлять на карту только объекты, попадающие в ее видимую область.
en: This example explains how to add only objects that fall in the visible area to the map.

source: Создадим объекты на основе JSON-описания геометрий.
en: Creating objects based on JSON descriptions of geometries.

source: Найдем объекты, попадающие в видимую область карты.
en: Finding objects in the visible area of the map.

source: И затем добавим найденные объекты на карту.
en: And then adding the found objects to the map.

source: После каждого сдвига карты будем смотреть, какие объекты попадают в видимую область.
en: After each shift of the map we will see what objects are in the visible area.

source: Оставшиеся объекты будем удалять с карты.
en: Then we'll delete the other objects from the map.

source: Примеры. Показ объектов в видимой области карты.
en: Examples. Displaying objects in the visible area of the map.

source: На карту добавляются только метки, попадающие в видимую область
en: Only placemarks that fall in the visible area are added to the map

source: В данном примере создание карты происходит при нажатии кнопки "Показать карту".
en: In this example, the map is created when the "Show map" button is clicked.

source: Изначально на странице размещается пустой div-контейнер. С помощью функции bind() для элемента button назначается обработчик события click, вызов которого приводит к созданию карты и ее размещению в указанном контейнере.
en: At first, an empty div container is placed on the page. The bind() function is used for the "button" element to assign a handler for the click event, which creates the map and puts it in the specified container when called.

source: Если при нажатии кнопки карта уже была создана, то вызывается метод destroy(), уничтожающий карту.
en: If the map has already been created when the button is clicked, the destroy() method is called and it destroys the map.

source: Как только будет загружен API и готов DOM, выполняем инициализацию
en: Performing initialization as soon as the API is loaded and the DOM is ready

source: Инициализация и уничтожение карты при нажатии на кнопку.
en: Initialization and destruction of the map when the button is clicked.

source: Примеры. Создание карты по требованию.
en: Examples. Creating maps on demand.

source: Показать карту
en: Show map

source: YMapsML, отображаемый на карте (см. файл ymapsml.xml), был автоматически сгенерирован с помощью XSLT на основе данных, которые изначально были представлены в формате GeoRSS (см. georss.xml). Шаблон преобразований содержится в файле georsstoymapsm_xsl.xml.
en: The YMapsML displayed on the map (see the ymapsml.xml file) was automatically generated using XSLT, from the data that was originally presented in GeoRSS format (see georss.xml). The conversion template is in the georsstoymapsm_xsl.xml file.

source: Примеры. Преобразование GeoRSS в YMapsML.
en: Examples. Converting GeoRSS to YMapsML.

source: Ломаная - это фигура, состоящая из набора последовательно соединённых вершин. Ломаная может иметь самопересечения.
en: A polyline is a shape consisting of a set of sequentially connected vertices. The polyline can have self-intersections.

source: Ломаные могут быть созданы двумя способами: с помощью класса GeoObject с указанием типа геометрии "Ломаная линия" либо с помощью вспомогательного класса Polyline.
en: The polyline can be created in two ways: using the GeoObject class with the "Polyline" geometry type, or using the Polyline auxiliary class.

source: При создании ломаной ей могут быть заданы свойства (например содержимое балуна или хинта) и опции (например: цвет, толщину).
en: When creating a polyline, you can set properties (such as the contents of a balloon or hint) and options (such as color and line width).

source: Ломаные, наряду с другими геообъектами, можно объединять в коллекции.
en: Polylines, like other geo objects, can be combined in collections.

source: Создаем ломаную, используя класс GeoObject.
en: Creating a polyline using the GeoObject class.

source: Тип геометрии - "Ломаная линия".
en: The "Polyline" geometry type.

source: Задаем опции геообъекта. Включаем возможность перетаскивания ломаной.
en: Setting the geo object options. Enabling drag-n-drop for the polyline.

source: Создаем ломаную с помощью вспомогательного класса Polyline.
en: Creating a polyline using the Polyline auxiliary class.

source: Задаем опции геообъекта. Отключаем кнопку закрытия балуна.
en: Setting options for the geo object. Disabling the close button on a balloon.

source: Коэффициент прозрачности.
en: The transparency coefficient.

source: Добавляем линии на карту.
en: Adding lines to the map.

source: Примеры. Ломаные
en: Examples. Polylines

source: Откроем балун на метке с id == 1.
en: Opening the balloon on the placemark with id == 1.

source: Сделаем так, чтобы указанный объект был "выбран" в балуне.
en: Making sure that the specified object has been "selected" in the balloon.

source: Все сгенерированные кластеры имеют уникальные идентификаторы. Этот идентификатор нужно передать в менеджер балуна, чтобы указать, на каком кластере нужно показать балун.
en: All the generated clusters have unique identifiers. This identifier must be passed to the balloon manager to specify which cluster to show the balloon on.

source: Для добавления на карту большого числа интерактивных объектов используется технология активных областей.
en: The hotspot technology is used for adding a large number of interactive objects to the map.

source: Изображения объектов добавляются на карту с помощью «картиночного слоя». Для его создания используется класс Layer.
en: Images of objects are added to the map using the "image layer". To create it, use the Layer class.

source: Информация об объектах (их границах и позиции) хранится на сервере и добавляется на карту через слой активных областей. Для создания этого слоя используется класс hotspot.Layer.
en: Information about objects (their boundaries and positions) is stored on the server and added to the map through the hotspot layer. To create this layer, use the hotspot.Layer class.

source: Перед созданием слоя активных областей необходимо создать его источник данных — объект, который будет запрашивать с сервера данные активных областей. Источник данных реализуется классом hotspot.ObjectSource.
en: Before creating the hotspot layer, we must create the data source — the object that will be requesting the hotspot data from the server. The data source is implemented by the hotspot.ObjectSource class.

source: В нашем примере хотспотные данные есть только для 9 и 10 масштаба. Поэтому ограничим диапазон коэффициентов масштабирования карты.
en: In our example, hotspot data is available only for zooms 9 and 10. For this reason, we will restrict the map's zoom range.

source: Шаблон URL для данных активных областей. Источник данных будет запрашивать данные через URL вида: '.../hotspot_layer/hotspot_data/9/tile_x=1&y=2', где x, y - это номер тайла, для которого запрашиваются данные, 9 - значение коэффициента масштабирования карты.
en: The URL pattern for hotspot data. The data source will request data through a URL of the form: '.../hotspot_layer/hotspot_data/9/tile_x=1&y=2', where x, y is the number of the tile that data is requested for, and 9 is the map zoom level.

source: Шаблон callback-функции, в которую сервер будет оборачивать данные тайла. Пример callback-функции после подстановки - 'testCallback_tile_x_1_y_2_z_9'.
en: The template for the callback function that the server will wrap tile data in. An example of a callback function after substitution is 'testCallback_tile_x_1_y_2_z_9'.

source: URL тайлов картиночного слоя. Пример URL после подстановки - '.../hotspot_layer/images/9/tile_x=1&y=2.png'.
en: URLs of tiles on the images layer. An example of a URL after substitution is '.../hotspot_layer/images/9/tile_x=1&y=2.png'.

source: Создадим источник данных слоя активных областей.
en: Creating the data source for the hotpsot layer.

source: Создаем картиночный слой и слой активных областей.
en: Creating the images layer and the hotspot layer.

source: Добавляем слои на карту.
en: Adding layers to the map.

source: Примеры. Использование технологии активных областей
en: Examples. Using hotspot technology

source: Создадим кластеризатор, вызвав функцию-конструктор. Список всех опций доступен в документации.
en: Creating a clusterer by calling a constructor function. A list of all options is available in the documentation.

source: Через кластеризатор можно указать только стили кластеров, стили для меток нужно назначать каждой метке отдельно.
en: Only cluster styles can be specified via the clusterer; for placemark styles, each placemark must be set separately.

source: Ставим true, если хотим кластеризовать только точки с одинаковыми координатами.
en: Setting to "true" if we want to cluster only points with the same coordinates.

source: Опции кластеров указываем в кластеризаторе с префиксом "cluster".
en: Setting cluster options in the clusterer with the "cluster" prefix.

source: Функция возвращает объект, содержащий данные метки. Поле данных clusterCaption будет отображено в списке геообъектов в балуне кластера. Поле balloonContentBody - источник данных для контента балуна. Оба поля поддерживают HTML-разметку. Список полей данных, которые используют стандартные макеты содержимого иконки метки и балуна геообъектов, можно посмотреть в документации.
en: The function returns an object containing the placemark data. The clusterCaption data field will appear in the list of geo objects in the cluster balloon. The balloonContentBody field is the data source for the balloon content. Both fields support HTML markup. For a list of data fields that are used by the standard content layouts for geo objects' placemark icons and balloons, see the documentation.

source: Функция возвращает объект, содержащий опции метки. Все опции, которые поддерживают геообъекты, можно посмотреть в документации.
en: The function returns an object containing the placemark options. All options that are supported by the geo objects can be found in the documentation.

source: Данные передаются вторым параметром в конструктор метки, опции - третьим.
en: Data is passed to the placemark constructor as the second parameter, and options are third.

source: Можно менять опции кластеризатора после создания.
en: You can change clusterer options after creation.

source: В кластеризатор можно добавить javascript-массив меток (не геоколлекцию) или одну метку.
en: You can add a JavaScript array of placemarks (not a geo collection) or a single placemark to the clusterer.

source: Спозиционируем карту так, чтобы на ней были видны все объекты.
en: Positioning the map so that all objects are visible.

source: Примеры. Добавление на карту кластеризатора меток
en: Examples. Adding a placemark clusterer to the map

source: Примеры. Задание собственного изображения для метки
en: Examples. Setting a custom placemark image

source: Опции. Необходимо указать данный тип макета.
en: Options. You must specify this type of layout.

source: Своё изображение иконки метки.
en: Custom image for the placemark icon.

source: Размеры метки.
en: The size of the placemark.
